### ðŸ”¸ Q7. Merging Two DataFrames
Merge two DataFrames:
- One with `Employee ID` and `Name`
- One with `Employee ID` and `Salary`  
Join them using `Employee ID`.

In [2]:
import pandas as pd
employees = pd.DataFrame({
    'Employee ID': [101, 102, 103],
    'Name': ['Ravi', 'Sneha', 'Arjun']
})

salaries = pd.DataFrame({
    'Employee ID': [101, 102, 103],
    'Salary': [50000, 60000, 55000]
})

In [8]:
merged_df = pd.merge(employees, salaries, on='Employee ID')
merged_df

   Employee ID   Name  Salary
0          101   Ravi   50000
1          102  Sneha   60000
2          103  Arjun   55000